In [1]:
import pandas as pd

In [2]:
from pandas import Series, DataFrame

In [3]:
obj = pd.Series([4,7,-5,3])

In [4]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
'year': [2000, 2001, 2002, 2001, 2002, 2003],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [7]:
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [8]:
frame.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [4]:
import numpy as np
frame = pd.DataFrame(np.arange(9).reshape((3, 3)), index=['a', 'c', 'd'], columns=['Ohio', 'Texas', 'California'])

In [5]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [6]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])

In [7]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [8]:
states = ['Ohio', 'Utah', 'Texas', 'California']

In [9]:
frame2.reindex(columns = states)

   Ohio  Utah  Texas  California
a   0.0   NaN    1.0         2.0
b   NaN   NaN    NaN         NaN
c   3.0   NaN    4.0         5.0
d   6.0   NaN    7.0         8.0

In [10]:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])

In [11]:
series2

b    0
e    1
f    2
dtype: int64

In [12]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])

In [13]:
obj

d    0
a    1
b    2
c    3
dtype: int64

In [15]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [16]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])

In [17]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [28]:
import pandas_datareader.data as web

In [30]:
all_data = {ticker: web.get_data_yahoo(ticker)
    for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}

ImmediateDeprecationError:
Yahoo Actions has been immediately deprecated due to large breaks in the API without the
introduction of a stable replacement. Pull Requests to re-enable these data
connectors are welcome.

See https://github.com/pydata/pandas-datareader/issues

In [39]:
pd.read_csv('test.csv', header = None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [40]:
pd.read_csv('test.csv', names = ['a', 'b', 'c', 'd', 'Message'])

   a   b   c   d Message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [41]:
names = ['a', 'b', 'c', 'd', 'Message']

In [42]:
pd.read_csv('test.csv', names = names, index_col='Message')

         a   b   c   d
Message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [44]:
pd.read_csv('test2.csv', index_col=['key1', 'key2'])

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [45]:
pd.options.display.max_rows = 2

In [46]:
pd.read_csv('test2.csv', index_col=['key1', 'key2'])

           value1  value2
key1 key2
one  a          1       2
...           ...     ...
two  d         15      16

[8 rows x 2 columns]

In [49]:
pd.read_csv('test2.csv', nrows=3)

   key1 key2  value1  value2
0   one    a       1       2
..  ...  ...     ...     ...
2   one    c       5       6

[3 rows x 4 columns]